kcs/notes/rock-paper-scissors.org
* Rock Paper Scissors Game

** What are the rules?
:PROPERTIES:
:ID:       17D6F155-FA61-4464-906D-97660EC1CC63
:END:

- Player can pick

  | Choices  |
  |----------|
  | Rock     |
  | Paper    |
  | Scissors |

  - Rock beats Scissors

  - Scissors beats Paper

  - Paper beats Rock

- Game is 3 rounds

  #+NAME: start
  #+BEGIN_SRC python :eval never 
  #
  # Start
  #
  r=3

  i=0
  #+END_SRC


- 2 people to play

  #+NAME: ask-player1
  #+BEGIN_SRC python :eval never 
    #
    # Ask Player 1 to choose rock paper or scissors
    #

    player1 = raw_input('Player 1, choose rock, paper or scissors: ')
  #+END_SRC

  #+NAME: ask-player2
  #+BEGIN_SRC python
    #
    # Ask Player 2 to choose rock paper or scissors
    #

    player2 = raw_input('Player 2, choose rock, paper or scissors: ')
  #+END_SRC

** How do we know which player wins?

| Player 1 | Player 2 | Winner   |
|----------+----------+----------|
| Rock     | Rock     | Tie      |
| Paper    | Paper    | Tie      |
| Scissors | Scissor  | Tie      |
| Rock     | Scissor  | Player 1 |
| Rock     | Paper    | Player 2 |
| Paper    | Rock     | Player 1 |
| Paper    | Scissor  | Player 2 |
| Scissors | Paper    | Player 1 |
| Scissors | Rock     | Player 2 |

#+NAME: make-check-winner 
#+BEGIN_SRC python :eval never 

  def checkwinner(p1,p2):
      if p1 == p2:
          return 'Tie'
      elif p1 == 'rock'     and p2 == 'scissors':
          return 'Player 1 wins!'
      elif p1 == 'rock'     and p2 == 'paper':
          return 'Player 2 wins!'
      elif p1 == 'paper'    and p2 == 'rock':
          return 'Player 1 wins!'
      elif p1 == 'paper'    and p2 == 'scissors':
          return 'Player 2 wins!'
      elif p1 == 'scissors' and p2 == 'paper':
          return 'Player 1 wins!'
      elif p1 == 'scissors' and p2 == 'rock':
          return 'Player 2 wins!'
      else:
          return 'Uh oh! I cannot tell who won the game!'

#+END_SRC

#+NAME: check-and-say-winner
#+BEGIN_SRC python :eval never 
  #
  # Check & Say Winner
  #

  print checkwinner(player1,player2)
#+END_SRC

* Rock Paper Scissors Program
:PROPERTIES:
:ID:       450ADD11-1659-49A4-AF22-FE9C7D8F737E
:END:

Below is the [[file:rock-paper-scissors.py]] program

#+NAME: rock-paper-scissors-program
#+BEGIN_SRC python :noweb yes :eval never :tangle yes :shebang #!/usr/bin/env python
  <<start>>

  <<make-check-winner>>

  #
  # Loop
  #

  while i < r:

      <<ask-player1>>

      <<ask-player2>>

      <<check-and-say-winner>>

      #
      # i+1
      #
      i = i + 1


  #
  # Stop
  #

#+END_SRC

